
//const =  파이, 최댓값, 생일,바뀌지 않는 값 , 대문자로 변수명 사용
//TIP!!! -> 일단 모든 변수를 const로 선언하고, 변경될 여지가 있는 변수는 let으로 바꿔줌

const PI = 3.14;
const SPEED_LIMIT = 50;
console.log("🚀 ~ file: 변수.js:7 ~ SPEED_LIMIT:", SPEED_LIMIT)
const BIRTH_DAY =  '1998-04-03';
//1. 변수는 문자와 숫자, $와  _만 사용.
const MY_HOME =  '---';
let_ = 1;
let$ = 3;
//2 . 첫글자는 숫자가 될 수 없다
// let 1stGrade = 'A+'; -> xx

// 3. 예약어 xx

//4. 가급적 상수는 대문자로 알려주세요
const MAX_SIZE = 99;
//5 . 변수명은 읽기 쉽고 이해할 수 있게 선언
//let a = 1; -> 뽀잉..
//let userNumber  = 3; --> 굳